---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldTextModule
source: html/adcaaa93-2c90-cb71-0346-a452c91b2ec4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldTextModule Property

"Text module"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldTextModule { get; }
```